# Задача 1-1: поработать с переменными, создать несколько, вывести на экран
# запросить у пользователя несколько чисел и строк и сохранить их в переменные + вывести на экран

a = 'hello'
b = 'world!'
print(f"{a}, {b}")
num1 = int(input('Введите целое число - '))
num2 = float(input('Введите десятичное число -'))
print(f"Вы ввели числа {num1} и {num2}")
word = input('Введите любое слово: ')
print(f"{word} - отличный выбор!")
