# Задача 1-5: Запросить у пользователя значение выручки и издержек фирмы. Определите результат
# Вывести сообщение о результате. Если фирма отработала с прибылью вычислите рентабельность выручки.
# Далее запросите численность сотрудников фирмы и определите прибыль фирмы в расчете на одного сотрудника.

revenue = float(input("Введите значение выручки - "))
costs = float(input("Введите значение издержек - "))
result = revenue - costs # формула прибыли
if result > 0:
    print(f"Поздравляю! Ваша компания работает с прибылью {result} !")
    print(f"Рентабельность выручки - {result / revenue:.3f}")
    workers = int(input("Сколько счастливых целых сотрудников работает в вашей компании? - "))
    print(f"Прибыль на одного сотрудника - {result / workers:.2f}")
elif result < 0:
    print(f"Вы работаете с убытком - {-result}")
else:
    print(f"Ноль - это тоже хороший результат! Зато стабильно!")
