# Задача 1-1: поработать с переменными, создать несколько, вывести на экран
# запросить у пользователя несколько чисел и строк и сохранить их в переменные + вывести на экран

name = input('Enter your name:')
age = int(input('Enter your age:'))
animal = input('Enter your favorite animal:')

print('Тебя зовут %s!' % name, 'тебе %s' % age, 'лет,', 'и твое любимое животное - %s.' % animal)
